Assignment and Practice of week 1

In [25]:
import numpy as np
import pandas as pd

In [26]:
data={
"Student_ID":[101,102,103,104,105],
"Student":["Amit","Bharat","Chetan","Deepak","Eshan"],
"Age":[20,21,19,22,20],
"country":["India","India","India","India","India"],
"Attendance_Percentage":[88,76,90,85,80],
"weeks_in_courses":[4,5,3,4,2],
"course_name":["Data Science","Web Development","Data Science","App Development","Data Science"],
"completed": [True, False, True, False, True],
"Final_Score":[85,78,92,88,76],
"Course_fees":[500,400,500,450,500],
}

In [27]:
df=pd.DataFrame(data)
df

,Student_ID,Student,Age,country,Attendance_Percentage,weeks_in_courses,course_name,completed,Final_Score,Course_fees
0,101,Amit,20,India,88,4,Data Science,True,85,500
1,102,Bharat,21,India,76,5,Web Development,False,78,400
2,103,Chetan,19,India,90,3,Data Science,True,92,500
3,104,Deepak,22,India,85,4,App Development,False,88,450
4,105,Eshan,20,India,80,2,Data Science,True,76,500

In [28]:
np.random.seed(42)
n=1000
df_new = pd.DataFrame({
    "Student_ID": np.arange(1, n+1),
    "Student": np.random.choice(['Amit', 'Bharat', 'Chetan', 'Deepak', 'Eshan'], n),
    "Age": np.random.randint(18, 30, n),
    "country": np.random.choice(['India', 'USA', 'UK', 'Canada'], n),
    "Attendance_Percentage": np.random.randint(50, 100, n),
    "weeks_in_courses": np.random.randint(1, 6, n),
    "course_name": np.random.choice(['Data Science', 'Web Development', 'App Development'], n),
    "completed": np.random.choice([True, False], n),
    "Final_Score": np.random.randint(50, 100, n),
    "Course_fees": np.random.choice([400, 450, 500], n)
})
df_new

,Student_ID,Student,Age,country,Attendance_Percentage,weeks_in_courses,course_name,completed,Final_Score,Course_fees
0,1,Deepak,29,UK,94,1,Data Science,True,53,400
1,2,Eshan,29,Canada,82,2,Data Science,False,91,400
2,3,Chetan,21,India,66,5,Data Science,False,94,450
3,4,Eshan,21,USA,55,2,Data Science,True,59,500
4,5,Eshan,22,Canada,53,2,App Development,True,80,500
...,...,...,...,...,...,...,...,...,...,...
995,996,Bharat,27,UK,90,2,App Development,False,83,500
996,997,Amit,25,Canada,61,5,Web Development,True,85,450
997,998,Amit,25,UK,98,4,App Development,False,86,500
998,999,Deepak,18,UK,64,4,Data Science,True,52,450
999,1000,Chetan,29,UK,80,2,Data Science,True,58,500

In [29]:
df1=pd.concat([df,df_new],ignore_index=True)
df1

,Student_ID,Student,Age,country,Attendance_Percentage,weeks_in_courses,course_name,completed,Final_Score,Course_fees
0,101,Amit,20,India,88,4,Data Science,True,85,500
1,102,Bharat,21,India,76,5,Web Development,False,78,400
2,103,Chetan,19,India,90,3,Data Science,True,92,500
3,104,Deepak,22,India,85,4,App Development,False,88,450
4,105,Eshan,20,India,80,2,Data Science,True,76,500
...,...,...,...,...,...,...,...,...,...,...
1000,996,Bharat,27,UK,90,2,App Development,False,83,500
1001,997,Amit,25,Canada,61,5,Web Development,True,85,450
1002,998,Amit,25,UK,98,4,App Development,False,86,500
1003,999,Deepak,18,UK,64,4,Data Science,True,52,450
1004,1000,Chetan,29,UK,80,2,Data Science,True,58,500

In [30]:
bootstrap = df.sample(n=200, replace=True, random_state=42)
df1 = pd.concat([df1, bootstrap], ignore_index=True)
df1

,Student_ID,Student,Age,country,Attendance_Percentage,weeks_in_courses,course_name,completed,Final_Score,Course_fees
0,101,Amit,20,India,88,4,Data Science,True,85,500
1,102,Bharat,21,India,76,5,Web Development,False,78,400
2,103,Chetan,19,India,90,3,Data Science,True,92,500
3,104,Deepak,22,India,85,4,App Development,False,88,450
4,105,Eshan,20,India,80,2,Data Science,True,76,500
...,...,...,...,...,...,...,...,...,...,...
1200,103,Chetan,19,India,90,3,Data Science,True,92,500
1201,103,Chetan,19,India,90,3,Data Science,True,92,500
1202,101,Amit,20,India,88,4,Data Science,True,85,500
1203,105,Eshan,20,India,80,2,Data Science,True,76,500
1204,104,Deepak,22,India,85,4,App Development,False,88,450

In [37]:
#introduce missing values in age, Marks and Department columns
for col in ["Age", "Final_Score", "course_name"]:
    df1.loc[df1.sample(frac=0.2).index, col] = np.nan

#Adding Duplicate rows 
df1 = pd.concat([df1, df1.sample(20)], ignore_index=True)

#Rename misspelled column to correct name if necessary
#if 'Departrment' in df.columns and 'Department' not in df.columns:
#df1 = df.rename(columns={'Departrment': 'Department'})

#Introduce invalid age values
df1.loc[df1.sample(20).index, 'Age'] = np.random.choice([-5, 240], size=20)

#outliers in Marks
df1.loc[df1.sample(20).index, 'Final_Score'] = np.random.choice([-10, 150], size=20)

#Inconsistent text formatting
#df['Department'] = df['Department'].astype(str)
#df.loc[df.sample(20).index, 'Department'] = df['Department'].str.lower()

In [38]:
df1

,Student_ID,Student,Age,country,Attendance_Percentage,weeks_in_courses,course_name,completed,Final_Score,Course_fees
0,101,Amit,NaN,India,88,4,NaN,True,85.0,500
1,102,Bharat,NaN,India,76,5,NaN,False,78.0,400
2,103,Chetan,NaN,India,90,3,Data Science,True,NaN,500
3,104,Deepak,NaN,India,85,4,NaN,False,88.0,450
4,105,Eshan,NaN,India,80,2,Data Science,True,NaN,500
...,...,...,...,...,...,...,...,...,...,...
1240,58,Bharat,NaN,India,93,4,Web Development,False,NaN,450
1241,63,Eshan,NaN,USA,85,4,NaN,True,NaN,500
1242,247,Deepak,NaN,UK,81,2,NaN,False,91.0,500
1243,291,Chetan,28.0,Canada,93,2,NaN,False,NaN,400
1244,724,Deepak,25.0,UK,99,4,NaN,False,NaN,450

In [39]:
#introduce missing values in age, Marks and Department columns
for col in ["Age", "Final_Score", "course_name"]:
    df1.loc[df.sample(frac=0.1).index, col] = np. nan

#Adding Duplicate rows 
df1 = pd.concat([df1, df1.sample(20)], ignore_index=True)

#Rename misspelled column to correct name if necessary
#if 'Departrment' in df.columns and 'Department' not in df.columns:
	#df = df.rename(columns={'Departrment': 'Department'})

#Introduce invalid age values
df1.loc[df1.sample(20).index, 'Age'] = np.random.choice([-5, 240], size=20)

#outliers in Marks
df1.loc[df1.sample(20).index, 'Marks'] = np.random.choice([-10, 150], size=20)

#Inconsistent text formatting
#df['Department'] = df['Department'].astype(str)
#df.loc[df.sample(20).index, 'Department'] = df['Department'].str.lower()

In [40]:
df1 = df1.copy()

In [41]:
#standaerized the column names
df1.columns = (df1.columns.str.strip().str.lower().str.replace(' ', '_'))

In [42]:
df1.columns

Index(['student_id', 'student', 'age', 'country', 'attendance_percentage',
       'weeks_in_courses', 'course_name', 'completed', 'final_score',
       'course_fees', 'marks'],
      dtype='object')

In [44]:
#Enforcing correct data types
df1['age'] = pd.to_numeric(df1['age'], errors='coerce')
df1['marks'] = pd.to_numeric(df1['marks'], errors='coerce')
df1['final_score'] = pd.to_numeric(df1['final_score'], errors='coerce')
#df['department'] = df['department'].astype(str)

In [45]:
#handling missing values
df1['age'] =df1['age'].fillna(df1['age'].median())

In [47]:
#handling duplicates
df1.drop_duplicates(inplace=True)

In [48]:
df1

,student_id,student,age,country,attendance_percentage,weeks_in_courses,course_name,completed,final_score,course_fees,marks
0,101,Amit,22.0,India,88,4,NaN,True,85.0,500,NaN
1,102,Bharat,22.0,India,76,5,NaN,False,78.0,400,NaN
2,103,Chetan,22.0,India,90,3,Data Science,True,NaN,500,NaN
3,104,Deepak,22.0,India,85,4,NaN,False,88.0,450,NaN
4,105,Eshan,22.0,India,80,2,Data Science,True,NaN,500,NaN
...,...,...,...,...,...,...,...,...,...,...,...
1221,39,Amit,21.0,USA,69,3,NaN,False,NaN,450,NaN
1224,645,Eshan,22.0,USA,73,1,App Development,True,89.0,500,NaN
1236,864,Bharat,22.0,Canada,81,3,Data Science,False,57.0,450,NaN
1242,247,Deepak,22.0,UK,81,2,NaN,False,91.0,500,NaN
1258,174,Deepak,-5.0,Canada,70,4,App Development,False,NaN,400,NaN

In [ ]:
valid_course_name = ['Physics', 'Chemistry', 'Mathematics', 'Biology', 'Computer Science']
df = df[df['Department'].isin(valid_departments)]
df